{
  "active": 0,
  "bio": "He has been dubbed The Great One, The People’s Champion and The Most Electrifying Man in All of Entertainment.Mere words fail to capture the essence of the most charismatic Superstar of all time, though the catchphrase “boots to asses” comes awfully close. The first third-generation Superstar in WWE history, the man born Dwayne Johnson was destined for sports-entertainment immortality since birth, but his rise to the status of a pop culture icon was harder to predict. In the time since he made his debut as a grinning good guy at the 1996 Survivor Series, The Brahma Bull has won eight WWE Championships, headlined WrestleMania, hosted “Saturday Night Live,” written a New York Times bestselling autobiography, top-billed the popular HBO series “Ballers,” and starred in films like “Fast Five” and “The Game Plan,” which have grossed literally billions of dollars.Tthe amazing thing is, he’s just getting started.Son of WWE Hall of Famer Rocky Johnson, the University of Miami football standout showed promise early when he won the Intercontinental Championship within months of first setting foot in the ring. From there, The Rock’s momentum never slowed as he laid the smackdown on “Attitude Era” rivals like “Stone Cold” Steve Austin and Triple H while spouting off endless catchphrases that immediately became part of national conversation. With one eyebrow cocked, The People’s Champion would warn jabronis to “Know your role and shut your mouth” or “Just bring it!” before delivering his devastating finishing maneuver, The Rock Bottom, on the way to victory.The 6-foot-5 competitor was soon fielding offers to star in films like “The Scorpion King” and “Gridiron Gang” thanks to the endless charisma and appeal he exuded in the squared circle. Despite a record-setting Hollywood career that included roles in the “Fast & Furious” franchises as well as “Pain & Gain,” “Hercules” and “San Andreas,” The Rock still returned to the ring against John Cena in the main event of WrestleMania XXVIII, won the WWE Championship from CM Punk in 2013 and defended it against Cena once again at WrestleMania 29 — all while proving to WWE’s newest generation of fans what their elders already knew: That he truly is The Most Electrifying Man in All of Entertainment. If ya smellllllll …",
  "championship": null,
  "faction": null,
  "id": 130,
  "image": "Dwayne_The_Rock_Johnson_stat.png",
  "name": "Dwayne \"The Rock\" Johnson",
  "show": 0,
  "slug": "the-rock",
  "tier": 0
}